Repository: ElenaLj/i18ndemo
Catalog: src/locale/messages.*.xlf
Languages: it

# subtitle
source: the process of designing and preparing your project for use in different locales around the world.
it: il processo di progettazione e preparazione del tuo progetto per l'uso in diverse località del mondo

# accordion-one
source: Why i18n?
it: Perché i18n?

# accordion-one-content
source: "i18n" is a numeronym. "18" stands for the number of letters bewteen the first letter ("i") and the last letter ("n") in the word <strong>internationalization</strong>
it: "i18n" è un numeronimo. "i18n" sta per il numero di lettere tra la prima lettera ("i") e l'ultima lettera ("n") nella parola inglese <strong>internationalization</strong>

# accordion-two
source: Why should you use it?
it: Perché dovresti usarlo?

# accordion-two-content
source: i18n enables the application to target any language in the world and is a <strong>must required feature </strong>for any modern web application. User can see dates, number, percentages and currencies in local format, handle plural forms of words, manage alternate texts, text in components templates for translations.
it: i18n permette all'applicazione di targhetizzare qualsiasi lingua nel mondo ed ` <strong>una feature essenziale</strong> per qualsiasi applicazione web moderna. L'utente può vedere date, numeri, percentuali e valute nel formato locale, gestire i plurali delle parole, gestire testi alternativi, il testo nel template del componente per le traduzioni.

# accordion-three
source: i18n and Angular
it: i18n e Angular

# accordion-three-content
source: Angular introduced this functionality in with v6 release in 2018 and it became largely adopted tool globally. Most of the online businesses are looking to expand their business into a global platform.
it: Angular introdusse questa funzionalità con la sesta release nel 2018 e divenne uno strumento largamente adottato globalmente. La maggior parte dei business online stanno guardando come espandere il loro business su una piattaforma globale.

# accordion-four
source: What is the concept of localization?
it: Cosa è il concetto di localizzazione

# accordion-four-content
source: Localization aka "l10n" is something which translates your internationalized "i18n" app into the local one - for specific region, locality or culture. There's huge potential that your app can gain maximum number of an audience.
it: Localizzazione alias "l10n" è ciò che traduce la tua app i18n in una app locale - per regioni, località o culture specifiche. C'è un grande potenziale che la tua app possa guadagnare il massimo numero di un pubblico

# accordion-five
source: What is the difference between l10n and i18n?
it: Qual'è la differenza tra l10n e i18n?

# accordion-five-content
source: We can say, Internationalization is to make you globally available without making any engineering changes, while localization is the term for helping your internationalized app locally adopted.
it: Si può dire che, l'internazionalizzazione ti rende globalmente disponibile senza apportare modifiche al codice, mentre la localizzazione è il termine designato ai processi che rendono la tua app internazionale localmente adottabile

# date
source: Today is {{ formattedDate }} in this locale → {{ locale | uppercase }}
it: Oggi è {{ formattedDate }} in questa località → {{ locale | uppercase }}
